Revit 2026 API

# AnalyticalLinkCreate Method

---

Creates a new instance of a AnalyticalLink element between two Hubs.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static AnalyticalLink Create(
	Document doc,
	ElementId type,
	ElementId startHubId,
	ElementId endHubId
)
```
```vb
Public Shared Function Create (
	doc As Document,
	type As ElementId,
	startHubId As ElementId,
	endHubId As ElementId
) As AnalyticalLink
```
```cpp
public:
static AnalyticalLink^ Create(
	Document^ doc,
	ElementId^ type,
	ElementId^ startHubId,
	ElementId^ endHubId
)
```
```fsharp
static member Create :
        doc : Document *
        type : ElementId *
        startHubId : ElementId *
        endHubId : ElementId -> AnalyticalLink
```

#### Parameters

doc Document
     Document to which new AnalyticalLink should be added.
type ElementId
     AnalyticalLinkType for the new AnalyticalLink.
startHubId ElementId
     Hub at start of AnalyticalLink.
endHubId ElementId
     Hub at end of AnalyticalLink.

#### Return Value

AnalyticalLink The newly created AnalyticalLink instance.

| Exception | Condition |
| --- | --- |
| ArgumentException | startHubId is not a valid Hub ID for an AnalyticalLink element. -or- endHubId is not a valid Hub ID for an AnalyticalLink element. -or- Thrown if startHubId or endHubId do not represent ids of Hubs. -or- Thrown if startHubId == endHubId. -or- Thrown if type does not represent an id of an AnalyticalLinkType. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

AnalyticalLink Class

Autodesk.Revit.DB.Structure Namespace